tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
brew "openssl@3", link: false
brew "python@3.12" force: true
brew "boost"
brew "boost-python3"
brew "gtk+3"
brew "gtkglext"
brew "sdl12-compat"
brew "mesa"
brew "mesa-glu"
brew "freeglut"
brew "openal-soft"
brew "cmake"
brew "expat"
brew "jpeg"
brew "libpng"
brew "libvorbis"
